{"modelArchitecture":"sequential","config":{"layers":[{"class_name":"Conv2D","config":{"name":"conv2d","trainable":true,"batch_input_shape":[null,28,28,1],"filters":32,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform"}},"bias_initializer":{"class_name":"Zeros"},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"MaxPooling2D","config":{"name":"max_pooling2d","trainable":true,"pool_size":[2,2],"strides":[2,2],"padding":"same","data_format":"channels_last"}},{"class_name":"Flatten","config":{"name":"flatten","trainable":true}},{"class_name":"Dense","config":{"name":"dense","trainable":true,"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform"}},"bias_initializer":{"class_name":"Zeros"},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout","trainable":true,"rate":0.2}},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1.0,"mode":"fan_avg","distribution":"uniform"}},"bias_initializer":{"class_name":"Zeros"},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null}}]},"weights":[]}